{"General": ["Regression analysis is primarily used for two conceptually distinct purposes.", "First, regression analysis is widely used for prediction and forecasting, where its use has substantial overlap with the field of machine learning.", "Second, in some situations regression analysis can be used to infer causal relationships between the independent and dependent variables.", "Importantly, regressions by themselves only reveal relationships between a dependent variable and a collection of independent variables in a fixed dataset.", "To use regressions for prediction or to infer causal relationships, respectively, a researcher must carefully justify why existing relationships have predictive power for a new context or why a relationship between two variables has a causal interpretation.", "The latter is especially important when researchers hope to estimate causal relationships using  observational data."], "History": ["In the 1950s and 1960s, economists used electromechanical desk \"calculators\" to calculate regressions.", "Before 1970, it sometimes took up to 24 hours to receive the result from one regression.", "Regression methods continue to be an area of active research.", "In recent decades, new methods have been developed for robust regression, regression involving correlated responses such as time series and growth curves, regression in which the predictor (independent variable) or response variables are curves, images, graphs, or other complex data objects, regression methods accommodating various types of missing data, nonparametric regression, Bayesian methods for regression, regression in which the predictor variables are measured with error, regression with more predictor variables than observations, and causal inference with regression."], "Regression model": ["In practice, researchers first select a model they would like to estimate and then use their chosen method (e.g., ordinary least squares) to estimate the parameters of that model.", "Regression models involve the following components:"], "The unknown parameters, often denoted as a scalar or vector ": ["   or random statistical noise:"], "  ": ["   exists."], "Underlying assumptions": ["By itself, a regression is simply a calculation using the data.", "In order to interpret the output of a regression as a meaningful statistical quantity that measures real-world relationships, researchers often rely on a number of classical assumptions.", "These often include:"], "The sample is representative of the population at large.": ["   within geographic units can have important consequences.", "The subfield of econometrics is largely focused on developing techniques that allow researchers to make reasonable real-world conclusions in real-world settings, where classical assumptions do not hold exactly."], "Linear regression": ["  :"], "straight line": ["    to the preceding regression gives:"], "parabola": ["     {\\displa"]}