{"General": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "It is a system with only one input, situation s, and only one output, action (or behavior) a. There is neither a separate reinforcement input nor an advice input from the environment.", "The backpropagated value (secondary reinforcement) is the emotion toward the consequence situation.", "The CAA exists in two environments, one is the behavioral environment where it behaves, and the other is the genetic environment, wherefrom it initially and only once receives initial emotions about situations to be encountered in the behavioral environment.", "After receiving the genome (species) vector from the genetic environment, the CAA learns a goal-seeking behavior, in an environment that contains both desirable and undesirable situations."], "Overview": ["Machine learning involves computers discovering how they can perform tasks without being explicitly programmed to do so.", "It involves computers learning from data provided so that they carry out certain tasks.", "For simple tasks assigned to computers, it is possible to program algorithms telling the machine how to execute all steps required to solve the problem at hand; on the computer's part, no learning is needed.", "For more advanced tasks, it can be challenging for a human to manually create the needed algorithms.", "In practice, it can turn out to be more effective to help the machine develop its own algorithm, rather than having human programmers specify every needed step.", "The discipline of machine learning employs various approaches to teach computers to accomplish tasks where no fully satisfactory algorithm is available.", "In cases where vast numbers of potential answers exist, one approach is to label some of the correct answers as valid.", "This can then be used as training data for the computer to improve the algorithm(s) it uses to determine correct answers.", "For example, to train a system for the task of digital character recognition, the MNIST dataset of handwritten digits has often been used."], "Machine learning approaches": ["Machine learning approaches are traditionally divided into three broad categories, depending on the nature of the \"signal\" or \"feedback\" available to the learning system:"], "Supervised learning": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "Similarity learning is an area of supervised machine learning closely related to regression and classification, but the goal is to learn from examples using a similarity function that measures how similar or related two objects are.", "It has applications in ranking, recommendation systems, visual identity tracking, face verification, and speaker verification."], "History and relationships to other fields": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "The term machine learning was coined in 1959 by Arthur Samuel, an American IBMer and pioneer in the field of computer gaming and artificial intelligence.", "A representative book of the machine learning research during the 1960s was the Nilsson's book on Learning Machines, dealing mostly with machine learning for pattern classification.", "Interest related to pattern recognition continued into the 1970s, as described by Duda and Hart in 1973.", "In 1981 a report was given on using teaching strategies so that a neural network learns to recognize 40 characters (26 letters, 10 digits, and 4 special symbols) from a computer terminal.", "Tom M. Mitchell provided a widely quoted, more formal definition of the algorithms studied in the machine learning field: \"A computer program is said to learn from experience E with respect to some class of tasks T and performance measure P if its performance at tasks in T, as measured by P,  improves with experience E.\" This definition of the tasks in which machine learning is concerned offers a fundamentally operational definition rather than defining the field in cognitive terms.", "This follows Alan Turing's proposal in his paper \"Computing Machinery and Intelligence\", in which the question \"Can machines think?\"", "is replaced with the question \"Can machines do what we (as thinking entities) can do?\"."], "Artificial intelligence": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "As a scientific endeavor, machine learning grew out of the quest for artificial intelligence.", "In the early days of AI as an academic discipline, some researchers were interested in having machines learn from data.", "They attempted to approach the problem with various symbolic methods, as well as what was then termed \"neural networks\"; these were mostly perceptrons and other models that were later found to be reinventions of the generalized linear models of statistics.", "Probabilistic reasoning was also employed, especially in automated medical diagnosis.", "However, an increasing emphasis on the logical, knowledge-based approach caused a rift between AI and machine learning.", "Probabilistic systems were plagued by theoretical and practical problems of data acquisition and representation.", "By 1980, expert systems had come to dominate AI, and statistics was out of favor.", "Work on symbolic/knowledge-based learning did continue within AI, leading to inductive logic programming, but the more statistical line of research was now outside the field of AI proper, in pattern recognition and information retrieval.", "Neural networks research had been abandoned by AI and computer science around the same time.", "This line, too, was continued outside the AI/CS field, as \"connectionism\", by researchers from other disciplines including Hopfield, Rumelhart and Hinton.", "Their main success came in the mid-1980s with the reinvention of backpropagation.", "Machine learning (ML), reorganized as a separate field, started to flourish in the 1990s.", "The field changed its goal from achieving artificial intelligence to tackling solvable problems of a practical nature.", "It shifted focus away from the symbolic approaches it had inherited from AI, and toward methods and models borrowed from statistics and probability theory.", "As of 2020, many sources continue to assert that machine learning remains a subfield of AI.", "The main disagreement is whether all of ML is part of AI, as this would mean that anyone using ML could claim they are using AI.", "Others have the view that not all of ML is part of AI where only an 'intelligent' subset of ML is part of AI.The question to what is the difference between ML and AI is answered by Judea Pearl in The Book of Why.", "Accordingly ML learns and predicts based on passive observations, whereas AI implies an agent  interacting with the environment to learn and take actions that maximize its chance of successfully achieving its goals."], "Data mining": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "Machine learning and data mining often employ the same methods and overlap significantly, but while machine learning focuses on prediction, based on known properties learned from the training data, data mining focuses on the discovery of (previously) unknown properties in the data (this is the analysis step of knowledge discovery in databases).", "Data mining uses many machine learning methods, but with different goals; on the other hand, machine learning also employs data mining methods as \"unsupervised learning\" or as a preprocessing step to improve learner accuracy.", "Much of the confusion between these two research communities (which do often have separate conferences and separate journals, ECML PKDD being a major exception) comes from the basic assumptions they work with: in machine learning, performance is usually evaluated with respect to the ability to reproduce known knowledge, while in knowledge discovery and data mining (KDD) the key task is the discovery of previously unknown knowledge.", "Evaluated with respect to known knowledge, an uninformed (unsupervised) method will easily be outperformed by other supervised methods, while in a typical KDD task, supervised methods cannot be used due to the unavailability of training data."], "Optimization": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "Machine learning also has intimate ties to optimization: many learning problems are formulated as minimization of some loss function on a training set of examples.", "Loss functions express the discrepancy between the predictions of the model being trained and the actual problem instances (for example, in classification, one wants to assign a label to instances, and models are trained to correctly predict the pre-assigned labels of a set of examples).", "The difference between the two fields arises from the goal of generalization: while optimization algorithms can minimize the loss on a training set, machine learning is concerned with minimizing the loss on unseen samples."], "Statistics": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "Some statisticians have adopted methods from machine learning, leading to a combined field that they call statistical learning."], "Theory": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "For the best performance in the context of generalization, the complexity of the hypothesis should match the complexity of the function underlying the data.", "If the hypothesis is less complex than the function, then the model has under fitted the data.", "If the complexity of the model is increased in response, then the training error decreases.", "But if the hypothesis is too complex, then the model is subject to overfitting and generalization will be poorer.", "In addition to performance bounds, learning theorists study the time complexity and feasibility of learning.", "In computational learning theory, a computation is considered feasible if it can be done in polynomial time.", "There are two kinds of time complexity results.", "Positive results show that a certain class of functions can be learned in polynomial time.", "Negative results show that certain classes cannot be learned in polynomial time."], "Approaches": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "The types of machine learning algorithms differ in their approach, the type of data they input and output, and the type of task or problem that they are intended to solve."], "Unsupervised learning": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "Cluster analysis is the assignment of a set of observations into subsets (called clusters) so that observations within the same cluster are similar according to one or more predesignated criteria, while observations drawn from different clusters are dissimilar.", "Different clustering techniques make different assumptions on the structure of the data, often defined by some similarity metric and evaluated, for example, by internal compactness, or the similarity between members of the same cluster, and separation, the difference between clusters.", "Other methods are based on estimated density and graph connectivity."], "Semi-supervised learning": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "In weakly supervised learning, the training labels are noisy, limited, or imprecise; however, these labels are often cheaper to obtain, resulting in larger effective training sets."], "Reinforcement learning": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "Reinforcement learning is an area of machine learning concerned with how software agents ought to take actions in an environment so as to maximize some notion of cumulative reward.", "Due to its generality, the field is studied in many other disciplines, such as game theory, control theory, operations research, information theory, simulation-based optimization, multi-agent systems, swarm intelligence, statistics and genetic algorithms.", "In machine learning, the environment is typically represented as a Markov decision process (MDP).", "Many reinforcement learning algorithms use dynamic programming techniques.", "Reinforcement learning algorithms do not assume knowledge of an exact mathematical model of the MDP, and are used when exact models are infeasible.", "Reinforcement learning algorithms are used in autonomous vehicles or in learning to play a game against a human opponent."], "Self learning": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "The self-learning algorithm updates a memory matrix W =||w(a,s)|| such that in each iteration executes the following machine learning routine:"], " In situation s perform an action a;": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "Update crossbar memory  w’(a,s) = w(a,s) + v(s’)."], "Feature learning": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "Feature learning can be either supervised or unsupervised.", "In supervised feature learning, features are learned using labeled input data.", "Examples include artificial neural networks, multilayer perceptrons, and supervised dictionary learning.", "In unsupervised feature learning, features are learned with unlabeled input data.", " Examples include dictionary learning, independent component analysis, autoencoders, matrix factorization and various forms of clustering.", "Manifold learning algorithms attempt to do so under the constraint that the learned representation is low-dimensional.", "Sparse coding algorithms attempt to do so under the constraint that the learned representation is sparse, meaning that the mathematical model has many zeros.", "Multilinear subspace learning algorithms aim to learn low-dimensional representations directly from tensor representations for multidimensional data, without reshaping them into higher-dimensional vectors.", "Deep learning algorithms discover multiple levels of representation, or a hierarchy of features, with higher-level, more abstract features defined in terms of (or generating) lower-level features.", "It has been argued that an intelligent machine is one that learns a representation that disentangles the underlying factors of variation that explain the observed data.", "Feature learning is motivated by the fact that machine learning tasks such as classification often require input that is mathematically and computationally convenient to process.", "However, real-world data such as images, video, and sensory data has not yielded to attempts to algorithmically define specific features.", "An alternative is to discover such features or representations thorough examination, without relying on explicit algorithms."], "Sparse dictionary learning": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "Sparse dictionary learning is a feature learning method where a training example is represented as a linear combination of basis functions, and is assumed to be a sparse matrix.", "The method is strongly NP-hard and difficult to solve approximately.", "A popular heuristic method for sparse dictionary learning is the K-SVD algorithm.", "Sparse dictionary learning has been applied in several contexts.", "In classification, the problem is to determine the class to which a previously unseen training example belongs.", "For a dictionary where each class has already been built, a new training example is associated with the class that is best sparsely represented by the corresponding dictionary.", "Sparse dictionary learning has also been applied in image de-noising.", "The key idea is that a clean image patch can be sparsely represented by an image dictionary, but the noise cannot."], "Anomaly detection": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "In data mining, anomaly detection, also known as outlier detection, is the identification of rare items, events or observations which raise suspicions by differing significantly from the majority of the data.", "Typically, the anomalous items represent an issue such as bank fraud, a structural defect, medical problems or errors in a text.", "Anomalies are referred to as outliers, novelties, noise, deviations and exceptions.", "In particular, in the context of abuse and network intrusion detection, the interesting objects are often not rare objects, but unexpected bursts of inactivity.", "This pattern does not adhere to the common statistical definition of an outlier as a rare object, and many outlier detection methods (in particular, unsupervised algorithms) will fail on such data unless it has been aggregated appropriately.", "Instead, a cluster analysis algorithm may be able to detect the micro-clusters formed by these patterns.", "Three broad categories of anomaly detection techniques exist.", "Unsupervised anomaly detection techniques detect anomalies in an unlabeled test data set under the assumption that the majority of the instances in the data set are normal, by looking for instances that seem to fit least to the remainder of the data set.", "Supervised anomaly detection techniques require a data set that has been labeled as \"normal\" and \"abnormal\" and involves training a classifier (the key difference to many other statistical classification problems is the inherently unbalanced nature of outlier detection).", "Semi-supervised anomaly detection techniques construct a model representing normal behavior from a given normal training data set and then test the likelihood of a test instance to be generated by the model."], "Robot learning": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "In developmental robotics, robot learning algorithms generate their own sequences of learning experiences, also known as a curriculum, to cumulatively acquire new skills through self-guided exploration and social interaction with humans.", "These robots use guidance mechanisms such as active learning, maturation, motor synergies and imitation."], "Association rules": [" The computer is presented with example inputs and their desired outputs, given by a \"teacher\", and the goal is to learn a general rule that maps inputs to outputs.", "Based on the concept of strong rules, Rakesh Agrawal, Tomasz Imieliński and Arun Swami"]}