{
    "introduction": "In statistical modeling, regression analysis is a set of statistical processes for estimating the relationships between a dependent variable (often called the `outcome variable`) and one or more independent variables (often called `predictors`, `covariates`, or `features`). The most common form of regression analysis is linear regression, in which a researcher finds the line (or a more complex linear combination) that most closely fits the data according to a specific mathematical criterion. For example, the method of ordinary least squares computes the unique line (or hyperplane) that minimizes the sum of squared differences between the true data and that line (or hyperplane). For specific mathematical reasons (see linear regression), this allows the researcher to estimate the conditional expectation (or population average value) of the dependent variable when the independent variables take on a given set of values. Less common forms of regression use slightly different procedures to estimate alternative location parameters (e.g., quantile regression or Necessary Condition Analysis) or estimate the conditional expectation across a broader collection of non-linear models (e.g., nonparametric regression). • Regression analysis is primarily used for two conceptually distinct purposes. First, regression analysis is widely used for prediction and forecasting, where its use has substantial overlap with the field of machine learning. Second, in some situations regression analysis can be used to infer causal relationships between the independent and dependent variables. Importantly, regressions by themselves only reveal relationships between a dependent variable and a collection of independent variables in a fixed dataset. To use regressions for prediction or to infer causal relationships, respectively, a researcher must carefully justify why existing relationships have predictive power for a new context or why a relationship between two variables has a causal interpretation. The latter is especially important when researchers hope to estimate causal relationships using  observational data.",
    "History": " The earliest form of regression was the method of least squares, which was published by Legendre in 1805, and by Gauss in 1809. Legendre and Gauss both applied the method to the problem of determining, from astronomical observations, the orbits of bodies about the Sun (mostly comets, but also later the then newly discovered minor planets). Gauss published a further development of the theory of least squares in 1821, including a version of the Gauss–Markov theorem. The term `regression` was coined by Francis Galton in the nineteenth century to describe a biological phenomenon. The phenomenon was that the heights of descendants of tall ancestors tend to regress down towards a normal average (a phenomenon also known as regression toward the mean). For Galton, regression had only this biological meaning, but his work was later extended by Udny Yule and Karl Pearson to a more general statistical context. In the work of Yule and Pearson, the joint distribution of the response and explanatory variables is assumed to be Gaussian. Fisher assumed that the conditional distribution of the response variable is Gaussian, but the joint distribution need not be. In this respect, Fisher`s assumption is closer to Gauss`s formulation of 1821. In the 1950s and 1960s, economists used electromechanical desk `calculators` to calculate regressions. Before 1970, it sometimes took up to 24 hours to receive the result from one regression.Regression methods continue to be an area of active research. In recent decades, new methods have been developed for robust regression, regression involving correlated responses such as time series and growth curves, regression in which the predictor (independent variable) or response variables are curves, images, graphs, or other complex data objects, regression methods accommodating various types of missing data, nonparametric regression, Bayesian methods for regression, regression in which the predictor variables are measured with error, regression with more predictor variables than observations, and causal inference with regression.",
    "Regression model": " In practice, researchers first select a model they would like to estimate and then use their chosen method (e.g., ordinary least squares) to estimate the parameters of that model. Regression models involve the following components:",
    "Underlying assumptions": " By itself, a regression is simply a calculation using the data. In order to interpret the output of a regression as a meaningful statistical quantity that measures real-world relationships, researchers often rely on a number of classical assumptions.",
    "Linear regression": " In linear regression, the model specification is that the dependent variable,                                    y                        i                                     {\\displaystyle y_{i}}    is a linear combination of the parameters (but need not be linear in the independent variables). For example, in simple linear regression for modeling                         n                 {\\displaystyle n}    data points there is one independent variable:                                    x                        i                                     {\\displaystyle x_{i}}   , and two parameters,                                    β                        0                                     {\\displaystyle \\beta _{0}}    and                                    β                        1                                     {\\displaystyle \\beta _{1}}   :",
    "General linear model": " In the more general multiple regression model, there are                         p                 {\\displaystyle p}    independent variables:",
    "Diagnostics": " Once a regression model has been constructed, it may be important to confirm the goodness of fit of the model and the statistical significance of the estimated parameters. Commonly used checks of goodness of fit include the R-squared, analyses of the pattern of residuals and hypothesis testing. Statistical significance can be checked by an F-test of the overall fit, followed by t-tests of individual parameters. Interpretations of these diagnostic tests rest heavily on the model`s assumptions. Although examination of the residuals can be used to invalidate a model, the results of a t-test or F-test are sometimes more difficult to interpret if the model`s assumptions are violated. For example, if the error term does not have a normal distribution, in small samples the estimated parameters will not follow normal distributions and complicate inference. With relatively large samples, however, a central limit theorem can be invoked such that hypothesis testing may proceed using asymptotic approximations.",
    "Limited dependent variables": " Limited dependent variables, which are response variables that are categorical variables or are variables constrained to fall only in a certain range, often arise in econometrics. The response variable may be non-continuous (`limited` to lie on some subset of the real line). For binary (zero or one) variables, if analysis proceeds with least-squares linear regression, the model is called the linear probability model. Nonlinear models for binary dependent variables include the probit and logit model. The multivariate probit model is a standard method of estimating a joint relationship between several binary dependent variables and some independent variables. For categorical variables with more than two values there is the multinomial logit. For ordinal variables with more than two values, there are the ordered logit and ordered probit models. Censored regression models may be used when the dependent variable is only sometimes observed, and Heckman correction type models may be used when the sample is not randomly selected from the population of interest. An alternative to such procedures is linear regression based on polychoric correlation (or polyserial correlations) between the categorical variables. Such procedures differ in the assumptions made about the distribution of the variables in the population. If the variable is positive with low values and represents the repetition of the occurrence of an event, then count models like the Poisson regression or the negative binomial model may be used.",
    "Nonlinear regression": " When the model function is not linear in the parameters, the sum of squares must be minimized by an iterative procedure. This introduces many complications which are summarized in Differences between linear and non-linear least squares.",
    "Interpolation and extrapolation": " Regression models predict a value of the Y variable given known values of the X variables. Prediction within the range of values in the dataset used for model-fitting is known informally as interpolation. Prediction outside this range of the data is known as extrapolation. Performing extrapolation relies strongly on the regression assumptions. The further the extrapolation goes outside the data, the more room there is for the model to fail due to differences between the assumptions and the sample data or the true values. It is generally advised that when performing extrapolation, one should accompany the estimated value of the dependent variable with a prediction interval that represents the uncertainty. Such intervals tend to expand rapidly as the values of the independent variable(s) moved outside the range covered by the observed data. For such reasons and others, some tend to say that it might be unwise to undertake extrapolation.However, this does not cover the full set of modeling errors that may be made: in particular, the assumption of a particular form for the relation between Y and X. A properly conducted regression analysis will include an assessment of how well the assumed form is matched by the observed data, but it can only do so within the range of values of the independent variables actually available. This means that any extrapolation is particularly reliant on the assumptions being made about the structural form of the regression relationship. Best-practice advice here is that a linear-in-variables and linear-in-parameters relationship should not be chosen simply for computational convenience, but that all available knowledge should be deployed in constructing a regression model. If this knowledge includes the fact that the dependent variable cannot go outside a certain range of values, this can be made use of in selecting the model – even if the observed dataset has no values particularly near such bounds. The implications of this step of choosing an appropriate functional form for the regression can be great when extrapolation is considered. At a minimum, it can ensure that any extrapolation arising from a fitted model is `realistic` (or in accord with what is known).",
    "Power and sample size calculations": " There are no generally agreed methods for relating the number of observations versus the number of independent variables in the model. One rule of thumb conjectured by Good and Hardin is                         N         =                    m                        n                                     {\\displaystyle N=m^{n}}   , where                         N                 {\\displaystyle N}    is the sample size,                         n                 {\\displaystyle n}    is the number of independent variables and                         m                 {\\displaystyle m}    is the number of observations needed to reach the desired precision if the model had only one independent variable. For example, a researcher is building a linear regression model using a dataset that contains 1000 patients (                        N                 {\\displaystyle N}   ). If the researcher decides that five observations are needed to precisely define a straight line (                        m                 {\\displaystyle m}   ), then the maximum number of independent variables the model can support is 4, because",
    "Other methods": " Although the parameters of a regression model are usually estimated using the method of least squares, other methods which have been used include:",
    "Software": " All major statistical software packages perform least squares regression analysis and inference. Simple linear regression and multiple regression using least squares can be done in some spreadsheet applications and on some calculators. While many statistical software packages can perform various types of nonparametric and robust regression, these methods are less standardized; different software packages implement different methods, and a method with a given name may be implemented differently in different packages. Specialized regression software has been developed for use in fields such as survey analysis and neuroimaging.",
    "See also": " References Further reading William H. Kruskal and Judith M. Tanur, ed. (1978), `Linear Hypotheses,` International Encyclopedia of Statistics. Free Press,  v. 1,Evan J. Williams, `I. Regression,` pp. 523–41. Julian C. Stanley, `II. Analysis of Variance,` pp. 541–554.Lindley, D.V. (1987). `Regression and correlation analysis,` New Palgrave: A Dictionary of Economics, v. 4, pp. Birkes, David and Dodge, Y., Alternative Methods of Regression. ISBN 0-471-56881-3 Chatfield, C. (1993) `Calculating Interval Forecasts,` Journal of Business and Economic Statistics, 11. pp. 121–135. Draper, N.R. ; Smith, H. (1998). Applied Regression Analysis (3rd ed.). John Wiley. ISBN 978-0-471-17082-2. Fox, J. (1997). Applied Regression Analysis, Linear Models and Related Methods. Sage Hardle, W., Applied Nonparametric Regression (1990), ISBN 0-521-42950-1 Meade, Nigel; Islam, Towhidul (1995). `Prediction intervals for growth curve forecasts`. Journal of Forecasting. 14 (5): 413–430. doi:10.1002/for.3980140502. A. Sen, M. Srivastava, Regression Analysis — Theory, Methods, and Applications, Springer-Verlag, Berlin, 2011 (4th printing). T. Strutz: Data Fitting and Uncertainty (A practical introduction to weighted least squares and beyond). Vieweg+Teubner, ISBN 978-3-8348-1022-9. Malakooti, B. (2013). Operations and Production Systems with Multiple Objectives. John Wiley & Sons.",
    "External links": " `Regression analysis`, Encyclopedia of Mathematics, EMS Press, 2001 [1994] Earliest Uses: Regression – basic history and references Regression of Weakly Correlated Data – how linear regression mistakes can appear when Y-range is much smaller than X-range"
}